[
    {
        "english_text": "Break the ice",
        "language": "French",
        "native_text": "Briser la glace",
        "meaning": "Initier une conversation ou une interaction dans une situation sociale inconfortable.",
        "explanation": "Cette expression signifie faire quelque chose pour aider les gens à se détendre et à se parler plus librement, souvent lors d'une première rencontre ou dans une situation tendue. Cela vient de l'idée que, tout comme on briserait la glace pour permettre à un bateau de passer, on brise également la tension sociale pour permettre aux échanges de commencer.",
        "examples": [
            "Lors de la réunion, elle a raconté une blague pour briser la glace.",
            "Pour briser la glace, il a commencé par parler de la météo.",
            "Ils ont organisé un jeu pour briser la glace entre les nouveaux employés."
        ]
    },
    {
        "english_text": "Bite the bullet",
        "language": "French",
        "native_text": "Prendre son courage à deux mains",
        "meaning": "Affronter une situation difficile ou désagréable avec courage.",
        "explanation": "L'idiome 'Bite the bullet' évoque le fait de faire face à la douleur ou à une situation pénible inévitable, souvent pour éviter de procrastiner ou de perdre du temps. L'origine de cette expression vient de l'époque des guerres, où les soldats mordaient une balle pour se concentrer sur leur douleur pendant une intervention chirurgicale.",
        "examples": [
            "Quand il a fallu choisir entre déménager pour un nouvel emploi ou rester dans sa zone de confort, il a décidé de prendre son courage à deux mains.",
            "Elle a dû prendre son courage à deux mains pour parler à son patron de sa promotion."
        ]
    },
    {
        "english_text": "Hit the nail on the head",
        "language": "French",
        "native_text": "Mettre le doigt sur le problème",
        "meaning": "Identifier ou comprendre quelque chose avec précision.",
        "explanation": "L'expression évoque l'idée de frapper le clou exactement au bon endroit, ce qui symbolise la précision et l'exactitude dans l'analyse ou la compréhension d'une situation.",
        "examples": [
            "Quand elle a expliqué la raison de son comportement, elle a vraiment mis le doigt sur le problème.",
            "Lors de la réunion, il a mis le doigt sur le problème principal que nous devions résoudre."
        ]
    },
    {
        "english_text": "Let the cat out of the bag",
        "language": "French",
        "native_text": "Vendre la mèche",
        "meaning": "Révéler un secret ou une information cachée.",
        "explanation": "Cette expression provient du marché, où des chats étaient parfois cachés dans des sacs pour tromper les acheteurs. Lorsqu'un chat était révélé, la tromperie était découverte.",
        "examples": [
            "Il a vendu la mèche sur la surprise de l'anniversaire.",
            "Elle a accidentellement vendu la mèche sur le projet secret.",
            "Nous devrions garder cela entre nous, sinon quelqu'un va vendre la mèche."
        ]
    },
    {
        "english_text": "Piece of cake",
        "language": "French",
        "native_text": "C'est du gâteau",
        "meaning": "C'est quelque chose de très facile à faire.",
        "explanation": "L'idiome 'C'est du gâteau' souligne la simplicité d'une tâche, tout comme un gâteau est considéré comme un plaisir simple à manger ou à préparer.",
        "examples": [
            "Faire ce devoir, c'est du gâteau.",
            "Réparer ce vélo ? C'est du gâteau !",
            "Comprendre cette leçon était du gâteau."
        ]
    },
    {
        "english_text": "Spill the beans",
        "language": "French",
        "native_text": "Vendre la mèche",
        "meaning": "Révéler un secret ou une information cachée.",
        "explanation": "L'idiome 'Vendre la mèche' signifie révéler une information secrète, souvent sans le vouloir. L'origine de cette expression provient probablement d'un jeu ou d'un concours où des fèves étaient utilisées pour voter, et si quelqu'un révélait le nombre de fèves avant la fin, cela ruinait le jeu.",
        "examples": [
            "Il a vendu la mèche au sujet de la surprise pour son anniversaire.",
            "Ne dis rien, sinon tu vas vendre la mèche !",
            "Elle a accidentellement vendu la mèche en parlant au téléphone."
        ]
    },
    {
        "english_text": "Costs an arm and a leg",
        "language": "French",
        "native_text": "Coûte les yeux de la tête",
        "meaning": "Cela signifie que quelque chose est très cher.",
        "explanation": "L'expression évoque l'idée que vous devez sacrifier quelque chose de précieux (comme un bras ou une jambe) pour obtenir quelque chose d'aussi cher que le prix demandé.",
        "examples": [
            "Ce nouveau téléphone coûte les yeux de la tête.",
            "Faire des rénovations dans cette maison coûte les yeux de la tête.",
            "Il a dépensé une fortune pour son nouveau costume, ça coûte les yeux de la tête."
        ]
    },
    {
        "english_text": "Burn the midnight oil",
        "language": "French",
        "native_text": "Brûler l'huile de minuit",
        "meaning": "Travailler tard dans la nuit, généralement pour étudier ou accomplir un travail.",
        "explanation": "Cette expression fait référence à l'utilisation d'une lampe à huile pour travailler ou étudier à une heure tardive, symbolisant l'effort supplémentaire consenti pour atteindre un objectif.",
        "examples": [
            "Je dois brûler l'huile de minuit pour terminer ce projet.",
            "Elle a brûlé l'huile de minuit pour réviser avant l'examen.",
            "Il brûle l'huile de minuit tous les soirs pour finaliser son livre."
        ]
    },
    {
        "english_text": "Under the weather",
        "language": "French",
        "native_text": "Malade",
        "meaning": "Se sentir mal ou être malade.",
        "explanation": "L'expression \"under the weather\" est souvent utilisée pour décrire une personne qui ne se sent pas bien, souvent à cause d'une maladie mineure ou d'un malaise général. L'origine de l'expression pourrait remonter aux marins qui, lorsqu'ils étaient malades, restaient à l'intérieur du navire et étaient ainsi 'en dessous' de la météo, qui se déroulait à l'extérieur.",
        "examples": [
            "Je ne vais pas au travail aujourd'hui, je me sens un peu sous le temps.",
            "Après avoir attrapé un rhume, elle se sentait vraiment sous le temps.",
            "Il a annulé ses plans de week-end parce qu'il était sous le temps."
        ]
    },
    {
        "english_text": "Once in a blue moon",
        "language": "French",
        "native_text": "Tous les trente-six du mois",
        "meaning": "Cela signifie que quelque chose se produit très rarement.",
        "explanation": "L'expression \"Once in a blue moon\" fait référence à un événement qui se produit très rarement, semblable à la rareté d'une pleine lune bleue, qui est un phénomène astronomique inhabituel. En français, une expression équivalente est \"Tous les trente-six du mois\", qui évoque aussi la rareté des événements.",
        "examples": [
            "Il va au cinéma une fois tous les trente-six du mois.",
            "Elle aime les visites surprises, mais elles arrivent tous les trente-six du mois."
        ]
    }
]