[
    {
        "english_text": "Break the ice",
        "language": "German",
        "native_text": "Das Eis brechen",
        "meaning": "Eine unangenehme oder formelle Situation auflockern und den ersten Schritt zu einer freundlicheren Interaktion machen.",
        "explanation": "Der Ursprung dieser Redewendung liegt in der Praxis, bei der Schiffe, die im Eis festsaßen, das Eis brechen mussten, um den Weg freizumachen. In übertragener Bedeutung bedeutet es, die erste Hürde in einer schwierigen oder unangenehmen Situation zu überwinden.",
        "examples": [
            "Sie hat ein paar Witze erzählt, um das Eis zu brechen, als sie die neuen Kollegen traf.",
            "Er hat während des Meetings das Eis gebrochen, indem er ein lustiges Video zeigte.",
            "Wir spielten ein Kennenlernspiel, um das Eis zwischen uns zu brechen."
        ]
    },
    {
        "english_text": "Bite the bullet",
        "language": "German",
        "native_text": "In den sauren Apfel beißen",
        "meaning": "Etwas Unangenehmes oder Schwieriges akzeptieren oder erfahren müssen.",
        "explanation": "Diese Redewendung bedeutet, sich einer unangenehmen Situation zu stellen oder eine schwierige Entscheidung zu treffen, obwohl man es nicht möchte. Der Ursprung stammt aus der Militärmedizin, wo Soldaten während chirurgischer Eingriffe auf einer Kugel beißen mussten, um den Schmerz zu lindern.",
        "examples": [
            "Ich weiß, dass die Prüfung schwer wird, aber ich muss in den sauren Apfel beißen und lernen.",
            "Es ist Zeit, in den sauren Apfel zu beißen und das Gespräch mit meinem Chef zu führen."
        ]
    },
    {
        "english_text": "Hit the nail on the head",
        "language": "German",
        "native_text": "Den Nagel auf den Kopf treffen",
        "meaning": "Etwas genau richtig einschätzen oder formulieren.",
        "explanation": "Dieses Sprichwort bedeutet, dass jemand eine Situation oder ein Problem genau erfasst oder beschrieben hat. Oft wird es verwendet, um zu sagen, dass jemand eine präzise oder treffende Analyse gegeben hat.",
        "examples": [
            "Er hat den Nagel auf den Kopf getroffen, als er die Gründe für unser Problem erklärte.",
            "Wenn du denkst, dass das die beste Lösung ist, dann hast du den Nagel auf den Kopf getroffen.",
            "Ihre Einschätzung der Lage hat den Nagel auf den Kopf getroffen."
        ]
    },
    {
        "english_text": "Let the cat out of the bag",
        "language": "German",
        "native_text": "Die Katze aus dem Sack lassen",
        "meaning": "Ein Geheimnis oder eine Information versehentlich preisgeben.",
        "explanation": "Der Ausdruck stammt vermutlich aus dem Handel, wo manchmal eine Katze in einem Sack versteckt war. Wenn der Sack geöffnet wurde, konnte die Katze herauskommen und das Geheimnis offenbaren.",
        "examples": [
            "Als er über die Überraschungsfeier sprach, ließ er die Katze aus dem Sack.",
            "Ich wusste, dass sie die Nachricht nicht weitergeben sollte, aber sie ließ die Katze aus dem Sack.",
            "Er hat die Katze aus dem Sack gelassen, als er den Namen des Gewinners nannte."
        ]
    },
    {
        "english_text": "Piece of cake",
        "language": "German",
        "native_text": "Ein Stück Kuchen",
        "meaning": "Etwas, das sehr einfach zu tun ist.",
        "explanation": "Das Idiom 'Piece of cake' bedeutet, dass etwas sehr einfach oder unkompliziert ist. Es wird oft verwendet, um zu sagen, dass eine Aufgabe wenig Mühe erfordert.",
        "examples": [
            "Die Prüfung war ein Stück Kuchen.",
            "Das Projekt war ein Stück Kuchen; ich habe es in kürzester Zeit abgeschlossen."
        ]
    },
    {
        "english_text": "Spill the beans",
        "language": "German",
        "native_text": "Lüfte das Geheimnis",
        "meaning": "Ein Geheimnis oder eine Information preisgeben.",
        "explanation": "Das Sprichwort \"Spill the beans\" bedeutet, ein geheimes oder verborgenes Wissen zu offenbaren. Ursprünglich stammt es aus den USA, wo es möglicherweise in einem Wettspiel verwendet wurde, bei dem Bohnen zur Abstimmung genutzt wurden. Wenn die Bohnen verschüttet wurden, waren die Stimmen bekannt und die Geheimhaltung war beendet.",
        "examples": [
            "Wenn du weißt, was passiert ist, dann spill the beans!",
            "Er wollte nicht spill the beans über die Überraschungsparty.",
            "Ich musste ihn überzeugen, die Details zu spill the beans."
        ]
    },
    {
        "english_text": "Costs an arm and a leg",
        "language": "German",
        "native_text": "Kostet ein Vermögen",
        "meaning": "Es ist sehr teuer oder kostspielig.",
        "explanation": "Diese Redewendung bedeutet, dass etwas unglaublich viel Geld kostet. Die Vorstellung ist, dass man bereit sein muss, einen wichtigen Teil von sich selbst (ein Arm oder ein Bein) zu opfern, um sich das Gewünschte leisten zu können.",
        "examples": [
            "Der neue Fernseher hat ein Vermögen gekostet.",
            "Die Reparatur des Autos kostet ein Vermögen.",
            "Ich wollte in Urlaub fahren, aber die Preise sind einfach verrückt, das kostet ein Vermögen."
        ]
    },
    {
        "english_text": "Burn the midnight oil",
        "language": "German",
        "native_text": "Die Mitternachtsöl verbrennen",
        "meaning": "Bis spät in die Nacht arbeiten oder lernen.",
        "explanation": "Dieses Idiom bezieht sich auf das Arbeiten oder Lernen zu später Stunde, oft bis in die frühen Morgenstunden. Der Ursprung liegt in der Zeit, als Menschen Öllampen benutzten, um bei Dunkelheit zu arbeiten oder zu lesen.",
        "examples": [
            "Ich muss für die Prüfung nächste Woche die Mitternachtsöl verbrennen.",
            "Er verbrannte das Mitternachtsöl, um das Projekt rechtzeitig abzuschließen."
        ]
    },
    {
        "english_text": "Under the weather",
        "language": "German",
        "native_text": "Nicht ganz auf der Höhe sein",
        "meaning": "Sich krank oder unwohl fühlen",
        "explanation": "Dieses Idiom beschreibt einen Zustand der körperlichen oder geistigen Unwohlseins. Es wird oft verwendet, um auszudrücken, dass jemand sich nicht wohlfühlt oder krank ist, ohne näher darauf einzugehen.",
        "examples": [
            "Ich kann heute nicht zur Arbeit gehen, ich bin etwas nicht ganz auf der Höhe.",
            "Nach dem langen Flug war ich ein bisschen nicht ganz auf der Höhe.",
            "Wenn du dich nicht ganz auf der Höhe fühlst, solltest du dich vielleicht ausruhen."
        ]
    },
    {
        "english_text": "Once in a blue moon",
        "language": "German",
        "native_text": "Alle Jubeljahre",
        "meaning": "Etwas geschieht sehr selten.",
        "explanation": "Der Ausdruck beschreibt ein Ereignis, das nur sehr selten vorkommt. Die 'blaue' Mondphase ist eine seltene astronomische Erscheinung, was den Vergleich erklärt.",
        "examples": [
            "Ich gehe nur alle Jubeljahre ins Kino.",
            "Mein Bruder kommt nur alle Jubeljahre zu Besuch."
        ]
    }
]