[
    {
        "text": "Break the ice",
        "meaning": "To initiate conversation in a social setting.",
        "explanation": "This idiom refers to the practice of breaking through social awkwardness to encourage interaction.",
        "examples": [
            "At the party, Sarah told a joke to break the ice.",
            "To break the ice, the host introduced everyone to each other."
        ]
    },
    {
        "text": "Bite the bullet",
        "meaning": "To endure a painful or unpleasant situation that is unavoidable.",
        "explanation": "This idiom originates from historical wartime practices where soldiers would bite on a bullet to cope with pain during surgery.",
        "examples": [
            "I hate going to the dentist, but I have to bite the bullet and make an appointment.",
            "Sometimes you just have to bite the bullet and face the consequences."
        ]
    },
    {
        "text": "Hit the nail on the head",
        "meaning": "To describe exactly what is causing a situation or problem.",
        "explanation": "This phrase suggests striking a nail accurately on the head, leading to a successful outcome.",
        "examples": [
            "When Jane said the team's communication was the problem, she hit the nail on the head.",
            "That explanation hit the nail on the head; now I understand!"
        ]
    },
    {
        "text": "Let the cat out of the bag",
        "meaning": "To reveal a secret inadvertently.",
        "explanation": "This idiom likely comes from a market practice where a cat was hidden in a bag, and revealing it meant exposing a deception.",
        "examples": [
            "I wasn't supposed to tell anyone about the surprise party, but I let the cat out of the bag.",
            "She let the cat out of the bag when she mentioned the new project."
        ]
    },
    {
        "text": "Piece of cake",
        "meaning": "Something that is very easy to do.",
        "explanation": "This expression compares an easy task to enjoying a slice of cake, which is generally a pleasant experience.",
        "examples": [
            "The exam was a piece of cake; I finished it in half the time.",
            "Cooking dinner is a piece of cake for me."
        ]
    },
    {
        "text": "Spill the beans",
        "meaning": "To disclose information, typically confidential or secret.",
        "explanation": "This idiom is thought to originate from an ancient voting method where beans were used, revealing the results openly.",
        "examples": [
            "He finally spilled the beans about his promotion.",
            "Don't spill the beans about the surprise!"
        ]
    },
    {
        "text": "Costs an arm and a leg",
        "meaning": "Something that is very expensive.",
        "explanation": "This phrase implies that the cost is so high it feels like you are paying with body parts.",
        "examples": [
            "That new car costs an arm and a leg!",
            "I would love to go on that trip, but it costs an arm and a leg."
        ]
    },
    {
        "text": "Burn the midnight oil",
        "meaning": "To work late into the night.",
        "explanation": "Historically, people used oil lamps for light, so burning the oil late signified working late hours.",
        "examples": [
            "I have to burn the midnight oil to finish this project on time.",
            "She burned the midnight oil studying for her final exams."
        ]
    },
    {
        "text": "Under the weather",
        "meaning": "Feeling ill or unwell.",
        "explanation": "This idiom suggests that someone's health is not quite right, akin to being affected by poor weather conditions.",
        "examples": [
            "I’m feeling a bit under the weather today; I might need to take a day off.",
            "He looked a little under the weather at the meeting."
        ]
    },
    {
        "text": "Once in a blue moon",
        "meaning": "Something that happens very rarely.",
        "explanation": "A blue moon refers to a rare second full moon in a month, implying infrequency.",
        "examples": [
            "I only see my old school friends once in a blue moon.",
            "He visits us once in a blue moon, but we always cherish those moments."
        ]
    }
]
