[
    {
        "english_text": "Break the ice",
        "language": "Spanish",
        "native_text": "Romper el hielo",
        "meaning": "Empezar una conversación en una situación social para aliviar la tensión o la incomodidad.",
        "explanation": "Esta expresión se origina de la práctica de romper el hielo en las aguas congeladas para permitir el paso de barcos. En un sentido social, se refiere a crear un ambiente más acogedor y amistoso para facilitar la interacción entre personas que no se conocen bien.",
        "examples": [
            "En la reunión, él contó un chiste para romper el hielo.",
            "Para romper el hielo, comenzamos con algunas preguntas divertidas.",
            "Ella siempre sabe cómo romper el hielo en las fiestas."
        ]
    },
    {
        "english_text": "Bite the bullet",
        "language": "Spanish",
        "native_text": "Aguardar el golpe",
        "meaning": "Aceptar una situación difícil o dolorosa.",
        "explanation": "La expresión se origina de la práctica de hacer que los soldados muerdan una bala durante operaciones quirúrgicas sin anestesia, para ayudar a soportar el dolor. Se utiliza en contextos donde alguien debe enfrentar una realidad dura con valentía.",
        "examples": [
            "Tendré que aguardar el golpe y hablar con mi jefe sobre el despido.",
            "Aunque me asusta, tengo que esperar el golpe y tomar la decisión que mejor me convenga.",
            "Es hora de que aguarde el golpe y enfrente mis miedos."
        ]
    },
    {
        "english_text": "Hit the nail on the head",
        "language": "Spanish",
        "native_text": "Dar en el clavo",
        "meaning": "Acertar exactamente en una situación o en un problema.",
        "explanation": "La expresión se utiliza cuando alguien ha entendido o expresado algo de manera precisa, e implica que es como si hubieran golpeado un clavo en el lugar correcto con un martillo.",
        "examples": [
            "El ingeniero dio en el clavo con su análisis del problema en la máquina.",
            "Cuando ella explicó la situación, realmente dio en el clavo.",
            "El discurso del presidente dio en el clavo respecto a las preocupaciones de la población."
        ]
    },
    {
        "english_text": "Let the cat out of the bag",
        "language": "Spanish",
        "native_text": "Dejar escapar el gato de la bolsa",
        "meaning": "Revelar un secreto o información que debía ser mantenida oculta",
        "explanation": "Esta expresión se utiliza para describir la acción de revelar algo que no debía ser dicho, particularmente un secreto. El origen exacto es incierto, pero se cree que proviene de la venta de gatos vivos en sacos durante el mercado; si se dejaba escapar el gato, se revelaba lo que realmente estaba dentro del saco.",
        "examples": [
            "No quería que supieran sobre la sorpresa, pero Juan dejó escapar el gato de la bolsa.",
            "Ella dejó escapar el gato de la bolsa cuando mencionó el nuevo proyecto antes de tiempo.",
            "Después de que Pedro habló sin pensar, todos supieron la verdad; había dejado escapar el gato de la bolsa."
        ]
    },
    {
        "english_text": "Piece of cake",
        "language": "Spanish",
        "native_text": "Pan comido",
        "meaning": "Algo que es muy fácil de hacer.",
        "explanation": "La expresión 'pan comido' se utiliza para describir una tarea que es sencilla o que se puede realizar con facilidad. Su origen proviene de la idea de que comer pan es una actividad común y fácil para la mayoría de las personas.",
        "examples": [
            "Hacer este ejercicio es pan comido.",
            "Aprobar el examen fue pan comido para ella."
        ]
    },
    {
        "english_text": "Spill the beans",
        "language": "Spanish",
        "native_text": "Revelar el secreto",
        "meaning": "Divulgar información confidencial o un secreto.",
        "explanation": "La expresión 'spill the beans' se refiere al acto de revelar algo que se debería mantener en secreto. La imagen aquí es de derramar frijoles, simbolizando la pérdida de algo que estaba contenido. Se asocia a veces con la idea de que, si se derraman los frijoles, se revela el contenido de una caja o un secreto.",
        "examples": [
            "No le cuentes nada a Juan, él siempre acaba revelando el secreto.",
            "Cuando le preguntaron sobre el proyecto, no pudo evitar derramar los frijoles."
        ]
    },
    {
        "english_text": "Costs an arm and a leg",
        "language": "Spanish",
        "native_text": "Cuesta un ojo de la cara",
        "meaning": "Algo muy caro o costoso",
        "explanation": "Este idiom significa que algo es extremadamente caro, generalmente más de lo que se esperaba pagar. La expresión sugiere que el costo es tan alto que sería como sacrificar una parte importante del cuerpo.",
        "examples": [
            "Esa casa cuesta un ojo de la cara.",
            "El viaje a Europa me costó un ojo de la cara."
        ]
    },
    {
        "english_text": "Burn the midnight oil",
        "language": "Spanish",
        "native_text": "Quemar el aceite de medianoche",
        "meaning": "Trabajar o estudiar tarde en la noche.",
        "explanation": "La expresión se refiere a la práctica de trabajar o estudiar durante las horas nocturnas, a menudo hasta altas horas de la noche, lo que requiere encender una lámpara (que quemaba aceite) para tener luz.",
        "examples": [
            "Estuve quemando el aceite de medianoche para terminar el proyecto a tiempo.",
            "Para estudiar para el examen, tuve que quemar el aceite de medianoche.",
            "Ella ha estado quemando el aceite de medianoche toda la semana trabajando en su tesis."
        ]
    },
    {
        "english_text": "Under the weather",
        "language": "Spanish",
        "native_text": "Bajo el tiempo",
        "meaning": "Sentirse mal o enfermo.",
        "explanation": "La expresión \"bajo el tiempo\" se utiliza para describir a alguien que no se siente bien, ya sea físicamente o emocionalmente. La lógica detrás de esta expresión proviene de la idea de que el clima puede influir en nuestro estado de ánimo y salud, especialmente durante épocas de mal tiempo.",
        "examples": [
            "Hoy no puedo salir, me siento bajo el tiempo.",
            "No vino a trabajar porque estaba bajo el tiempo."
        ]
    },
    {
        "english_text": "Once in a blue moon",
        "language": "Spanish",
        "native_text": "De vez en cuando",
        "meaning": "Se refiere a algo que sucede muy rara vez.",
        "explanation": "La expresión 'de vez en cuando' significa que algo ocurre muy infrecuentemente, similar a la aparición de una luna azul, que es un fenómeno poco común en el ciclo lunar.",
        "examples": [
            "Voy al cine de vez en cuando.",
            "De vez en cuando, me gusta leer un buen libro.",
            "Ella visita a sus amigos de vez en cuando."
        ]
    }
]
